homework3/AirportInfosCA/test/TestNoGMT/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:what="http://j2ee.netbeans.org/wsdl/AirportInfos/src/WhatsTheAirport">
  <soapenv:Body>
    <what:WhatsTheAirportOperation>
      <AirportCode>TAV</AirportCode>
    </what:WhatsTheAirportOperation>
  </soapenv:Body>
</soapenv:Envelope>